# put your python code here
print('','','','','','','','','','','','','','','','','','',sep='*')
print('*','','','','','','','','','','','','','','','*')
print('*','','','','','','','','','','','','','','','*')
print('','','','','','','','','','','','','','','','','','',sep='*')


'''
Звездный прямоугольник
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

Примечание. Высота и ширина прямоугольника равны 44 и 1717 звёздочкам соответственно.

Sample Input:

Sample Output:
*****************
*               *
*               *
*****************
'''
