# put your python code here
n=int(input())
print(n*100+n*10*2+n*3)

'''
Размножение n-ок
Напишите программу, которая считывает целое положительное число n∈[1;9]
и выводит значение числа n+{nn}+{nnn}

Формат входных данных
На вход программе подаётся одно целое положительное число n∈[1;9].

Формат выходных данных
Программа должна вывести число n+{nn}+{nnn}

Примечание. Для первого теста 1 + 11 + 111 = 123

Sample Input 1:
1

Sample Output 1:
123
'''