# put your python code here
num_a=int(input())

if num_a==1:
    print('I')
elif num_a==2:
    print('II')
elif num_a==3:
    print('III')
elif num_a==4:
    print('IV')
elif num_a==5:
    print('V')
elif num_a==6:
    print('VI')
elif num_a==7:
    print('VII')
elif num_a==8:
    print('VIII')
elif num_a==9:
    print('IX')
elif num_a==10:
    print('X')
else:
    print('ошибка')


'''
Римские цифры
Напишите программу, которая считывает целое число и выводит соответствующую ему римскую цифру. Если число находится вне диапазона 1-10, то программа должна вывести текст «ошибка».

В таблице приведены римские цифры для чисел от 1 до 10.

Число	Римская цифра
1	I
2	II
3	III
4	IV
5	V
6	VI
7	VII
8	VIII
9	IX
10	X
Формат входных данных
На вход программе подаётся целое число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Тестовые данные 🟢
Sample Input 1:

7
Sample Output 1:

VII
'''
