# put your python code here
a,b,c,d,e= float(input()),float(input()),float(input()),float(input()),float(input())

print(abs(a)+abs(b)+abs(c)+abs(d)+abs(e))
'''
Абсолютная сумма
Даны пять чисел a_1, \, a_2, \, a_3, \, a_4, \, a_5a 
1
​
 ,a 
2
​
 ,a 
3
​
 ,a 
4
​
 ,a 
5
​
 . Напишите программу, которая вычисляет сумму их модулей |a_1| + |a_2| +|a_3| +|a_4| + |a_5|∣a 
1
​
 ∣+ ∣a 
2
​
 ∣+∣a 
3
​
 ∣+∣a 
4
​
 ∣+ ∣a 
5
​
 ∣.

Формат входных данных
На вход программе подается пять действительных чисел a_1, \, a_2, \, a_3, \, a_4, \, a_5a 
1
​
 ,a 
2
​
 ,a 
3
​
 ,a 
4
​
 ,a 
5
​
 , каждое на отдельной строке.

Формат выходных данных
Программа должна вывести одно число – сумму модулей введённых чисел.

Тестовые данные 🟢
Sample Input 1:

5.4
33
-1232
-3.889
6
Sample Output 1:

1280.289
'''
