# put your python code here
s=input() 
if 'синий' in s:
    print('YES') 
else:
    print('NO') 

'''
Цвет настроения синий
Напишите программу, которая считывает одну строку, после чего выводит «YES», если в введенной строке есть подстрока «синий» и «NO» в противном случае.

Формат входных данных
На вход программе подается одна строка.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Тестовые данные 🟢
Sample Input 1:

Какой хороший день!
Sample Output 1:

NO
'''
