# put your python code here
num=float(input())

print(num-int(num))

'''
Дробная часть
Дано положительное действительное число. Выведите его дробную часть.

Формат входных данных
На вход программе подается положительное действительное число.

Формат выходных данных
Программа должна вывести дробную часть числа в соответствии с условием задачи.

Тестовые данные 🟢
Sample Input 1:

44.45
Sample Output 1:

0.45
'''
