# put your python code here
min=int(input())
print(min,'мин - это',min//60,'час',min%60,"минут.")

'''
Пересчет временного интервала
Напишите программу для пересчёта величины временного интервала, заданного в минутах, в величину, выраженную в часах и минутах.

Формат входных данных
На вход программе подаётся целое число – количество минут.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Sample Input 1:

150
Sample Output 1:

150 мин - это 2 час 30 минут.
'''
