# put your python code here
val1=int(input())
val2=int(input())
val3=int(input())
val4=int(input())
print((val1+val2+val3+val4)*3)

'''
Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора, системного блока, клавиатуры и мыши.

Sample Input 1:
9900
55600
3999
2990

Sample Output 1:
217467
'''
