# put your python code here
str=input()

while str!='КОНЕЦ':
    print(str)
    str=input()

'''
До КОНЦА 1
На вход программе подается последовательность слов, каждое слово на отдельной строке. Концом последовательности является слово «КОНЕЦ» (без кавычек). Напишите программу, которая выводит члены данной последовательности.

Формат входных данных
На вход программе подается последовательность слов, каждое слово на отдельной строке.

Формат выходных данных
Программа должна вывести члены данной последовательности.

Тестовые данные 🟢
Sample Input 1:

Fus
Ro
КОНЕЦ
Dah
Sample Output 1:

Fus
Ro
'''
