# put your python code here
num1=int(input())
num2=int(input())
num3=int(input())
num4=int(input())
if num1<num2:
    ab=num1
else:
    ab=num2    
if num3<num4:
    cd=num3
else:
    cd=num4     
if ab<cd:
    print(ab)
else:
    print(cd)


'''
Наименьшее из четырёх чисел 🌶️
Напишите программу, которая определяет наименьшее из четырёх чисел.

Формат входных данных
На вход программе подаётся четыре целых числа.

Формат выходных данных
Программа должна вывести наименьшее из четырёх чисел.

Тестовые данные 🟢
Sample Input 1:

1
2
3
4
Sample Output 1:

1
'''
