# put your python code here
n=int(input())
last_digit=0
while n!=0:
    print(n%10)
    n=n//10

'''
Обратный порядок 1
Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

Формат входных данных 
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести цифры введенного числа в столбик в обратном порядке.

Тестовые данные 🟢
Sample Input 1:

12345
Sample Output 1:

5
4
3
2
1
Sample Input 2:

55690454
'''
