# put your python code here
str=input()

while str !="КОНЕЦ" and str !='конец':
    print(str)
    str=input()
    
'''
До КОНЦА 2
На вход программе подается последовательность слов, каждое слово на отдельной строке. Концом последовательности является слово «КОНЕЦ» или «конец» (большими или маленькими буквами, без кавычек). Напишите программу, которая выводит члены данной последовательности.

Формат входных данных
На вход программе подается последовательность слов, каждое слово на отдельной строке.

Формат выходных данных
Программа должна вывести члены данной последовательности.

Тестовые данные 🟢
Sample Input 1:

JavaScript
C++
C#
Ruby
PHP
КОНЕЦ
Python
Sample Output 1:

JavaScript
C++
C#
Ruby
PHP
'''
