# put your python code here
print('"Python is a great language!"'+', said Fred. '+'"I'+" don't"+' ever remember having this much fun before."')

'''
Напишите программу, которая выводит текст:

"Python is a great language!", said Fred. "I don't ever remember having this much fun before."

Примечание. Используйте конкатенацию строк.

Тестовые данные 🟢
Sample Input:

Sample Output:

"Python is a great language!", said Fred. "I don't ever remember having this much fun before."
'''
