# put your python code here
from math import *
a, b=float(input()), float(input()) 

print((a+b) /2)
print(sqrt(a*b))
print((2*a*b)/(a+b))
print(sqrt((a**2 +b**2)/2))

'''
Средние значения
В математике выделяют следующие средние значения:

среднее арифметическое чисел aa и bb: \dfrac{a+b}{2} 
2
a+b
​
 ;
 
среднее геометрическое чисел aa и bb: \sqrt{a\cdot b} 
a⋅b
​
 ;
 
среднее гармоническое чисел aa и bb: \dfrac{2ab}{a+b} 
a+b
2ab
​
 ;
 
среднее квадратичное чисел aa и bb: \sqrt{\dfrac{a^2+b^2}{2}} 
2
a 
2
 +b 
2
 
​
 
​
 .
Формат входных данных
На вход программе подается два вещественных числа aa и bb​, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести 4 числа – среднее арифметическое, геометрическое, гармоническое и квадратичное.

Тестовые данные 🟢
Sample Input 1:

1.0
2.0
Sample Output 1:

1.5
1.4142135623730951
1.3333333333333333
1.5811388300841898
'''
