# put your python code here
num1=int(input())
num2=int(input())
print(num1,'+',num2,'=',num1+num2)
print(num1,'-',num2,'=',num1-num2)
print(num1,'*',num2,'=',num1*num2)

'''
Арифметические операции
Напишите программу, в которой вычисляется сумма, разность и произведение двух целых чисел, введенных с клавиатуры.

Sample Input 1:
2
7

Sample Output 1:
2 + 7 = 9
2 - 7 = -5
2 * 7 = 14
'''
