# put your python code here
b=int(input())
q=int(input())
n=int(input())
print(b*q**(n-1))

'''
Геометрическая прогрессия

Входные данные
На вход программе подаётся три целых числа: b1, q и n, каждое на отдельной строке.

Выходные данные
Программа должна вывести n-ый член геометрической прогрессии.

Sample Input 1:
1
2
5

Sample Output 1:
16

'''
