# put your python code here
sant=int(input())
print(sant//100)

'''
Расстояние в метрах
Напишите программу, которая находит полное число метров по заданному числу сантиметров.

Формат входных данных
На вход программе подаётся натуральное число – количество сантиметров.

Формат выходных данных
Программа должна вывести одно число – полное число метров.

Sample Input 1:
345
Sample Output 1:
3
'''
