# put your python code here
num=int(input())
print('Сумма цифр =',num//100+num%100//10+num%10)
print('Произведение цифр =',(num//100)*(num%100//10)*(num%10))

'''
Трехзначное число
Напишите программу, в которой рассчитывается сумма и произведение цифр положительного трёхзначного числа.

Формат входных данных
На вход программе подаётся положительное трёхзначное число.

Формат выходных данных
Программа должна вывести два числа с поясняющим текстом: сумма цифр и произведение цифр.

Sample Input 1:

123
Sample Output 1:

Сумма цифр = 6
Произведение цифр = 6
'''
