# put your python code here
a=int(input())
d=int(input())
n=int(input())
print(a+d*(n-1))

'''
Арифметическая прогрессия
Входные данные
На вход программе подаётся три целых числа: a1, d и n, каждое на отдельной строке.

Выходные данные
Программа должна вывести n-ый член арифметической прогрессии.

Sample Input 1:
1
1
10

Sample Output 1:
10
'''
