# put your python code here
f=float(input())
c=5*(f-32)/9

print(c )
'''
451 градус по Фаренгейту 
У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.

Используйте формулу для перевода: C = \dfrac{5}{9}\left(F - 32\right)C= 
9
5
​
 (F− 32).

Формат входных данных
На вход программе подаётся вещественное число градусов по шкале Фаренгейта.

Формат выходных данных
Программа должна вывести число градусов по шкале Цельсия.

Тестовые данные 🟢
Sample Input 1:

450.55
Sample Output 1:

232.5277777777778
'''
