# put your python code here
num1=int(input())
print(num1,num1+1,num1+2,sep='\n')


'''Напишите программу вывода на экран трех последовательно идущих чисел,
каждое на отдельной строке. Первое число вводит пользователь,
остальные числа вычисляются в программе.

Sample Input 1:
8

Sample Output 1:
8
9
10
'''
