# put your python code here
x=int(input())
print(x,x*2,x*3,x*4,x*5,sep='---')

'''
Разделяй и властвуй
Напишите программу, которая считывает целое положительное число x
и выводит на экран последовательность чисел x,2x,3x,4x и 5x, разделённых тремя черточками.

Тестовые данные 🟢
Sample Input 1:
7

Sample Output 1:
7---14---21---28---35
'''
