# put your python code here
text1=input()
text2=input()
text3=input()
print(text1)
print(text2)
print(text3)

#Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности, каждую на отдельной строчке.
"""
Sample Input 1:
I was
born
this way

Sample Output 1:
I was
born
this way
"""
