# put your python code here
name = input()
print(name,"- чемпион!")


#На вход программе подается строка текста – название футбольной команды.
#Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).
