# put your python code here
a=int(input()) 
b=int(input()) 
print(3*(a+b)**3+275*b**2-127*a-41)

'''
Напишите программу вычисления значения функции f(a,b) = 3(a + b)^3 + 275b^2 - 127a - 41

Sample Input 1:
1
1

Sample Output 1:
131

'''
