# put your python code here
n=int(input())
sum=0
for i in range (1,n+1):
    sum+=int(input())
print(sum)    

'''
Сумма чисел
На вход программе подается натуральное число nn, а затем nn целых чисел, каждое на отдельной строке. Напишите программу, которая подсчитывает сумму введенных чисел. 

Формат входных данных
На вход программе подаются натуральное число nn, а затем nn целых чисел, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести сумму данных чисел.

Тестовые данные 🟢
Sample Input:

5
3
2
1
0
-1
Sample Output:

5
'''
