# put your python code here
num1=int(input())
num2=int(input())
num3=int(input())
print(num1+num2+num3)


'''
Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
Каждое число записано в отдельной строке.
Sample Input 1:
9
11
2

Sample Output 1:
22
'''