# put your python code here
name=input()
print('Привет, ',end='')
print(name,'!',sep='')

'''
Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек),
после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.

Формат входных данных:
На вход программе подаётся одна строка — имя пользователя.
Sample Input 1:

Тирион
Sample Output 1:

Привет, Тирион!
'''
