# put your python code here
sep1=input()
text1=input()
text2=input()
text3=input()
print(text1, text2, text3,sep=sep1)


'''
Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.

Формат входных данных
На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введённые три строки через разделитель.

Sample Input 1:
*
Раз
Два
Три

Sample Output 1:
Раз*Два*Три
'''
