# put your python code here
len1=int(input()) 
print('Объем =', len1**3)
print('Площадь полной поверхности =',6*(len1**2) )

'''
Напишите программу, вычисляющую объём куба
и площадь его полной поверхности,
по введённому значению длины ребра.

Sample Input 1:
25

Sample Output 1:
Объем = 15625
Площадь полной поверхности = 3750
'''
