# put your python code here
num1=int(input())
num2=int(input())
if num1>num2:
    print(num2)
else:
    print(num1)



'''
Наименьшее из двух чисел
Напишите программу, которая определяет наименьшее из двух чисел.

Формат входных данных
На вход программе подаётся два различных целых числа.

Формат выходных данных
Программа должна вывести наименьшее из двух чисел.

Тестовые данные 🟢
Sample Input 1:

8
11
Sample Output 1:

8
'''
