# put your python code here
from math import *
r=float(input() ) 
print(pi*pow(r, 2))
print(2*pi*r)

'''
Площадь и длина
Напишите программу определяющую площадь круга и длину окружности по заданному радиусу RR.

Формат входных данных
На вход программе подается одно вещественное число RR​.

Формат выходных данных
Программа должна вывести два числа – площадь круга и длину окружности радиуса RR.



Примечание. Используйте константу math.pi. 

Тестовые данные 🟢
Sample Input 1:

554.6
Sample Output 1:

966294.7126386268
3484.654571361799
'''
