# put your python code here
text1=input()
text2=input()
text3=input()
print(text3)
print(text2)
print(text1)

"""
Напишите программу, которая считывает три строки по очереди,
а затем выводит их в обратной последовательности, каждую на отдельной строчке.

Sample Input 1:
Hello
it's
me

Sample Output 1:
me
it's
Hello
"""
