# put your python code here

name=input()

print('Футбольная команда '+name+' имеет длину '+str(len(name))+' символов')



'''
Футбольная команда
Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:

«Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».

Формат входных данных
На вход программе подаётся строка – название футбольной команды.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Тестовые данные 🟢
Sample Input 1:

Barcelona
Sample Output 1:

Футбольная команда Barcelona имеет длину 9 символов
'''
