# put your python code here
for i in range (6):
    print('AAA')
for i in range (5):
    print('BBBB')    
print('E')
for i in range (9):
    print('TTTTT')
print('G')    

'''
Последовательность символов
Напишите программу, которая использует ровно три цикла for для печати следующей последовательности символов:

AAA
AAA
AAA
AAA
AAA
AAA
BBBB
BBBB
BBBB
BBBB
BBBB
E
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
G
Формат входных данных

Формат выходных данных
Программа должна вывести указанную последовательность символов.

Тестовые данные 🟢
Sample Input:

Sample Output:

AAA
AAA
AAA
AAA
AAA
AAA
BBBB
BBBB
BBBB
BBBB
BBBB
E
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
G
'''
