# put your python code here
num2=int(input())
print('Следующее за числом',num2, 'число:',num2+1)
print('Для числа',num2, 'предыдущее число:',num2-1)

'''
Напишите программу, которая считывает целое число, после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.

Sample Input 1:
20

Sample Output 1:
Следующее за числом 20 число: 21
Для числа 20 предыдущее число: 19
'''
